---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralR
source: html/6284e235-2a2b-5e54-7b6d-0560f4088361.htm
---
# StructuralSectionGeneralR Members

Creates a new instance of Structural Section Pipe.